Revit 2020 API
Document.Link Method (String, DWFImportOptions)
 Links Markups in a DWF file to the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public IList<ElementId> Link(
	string file,
	DWFImportOptions options
)
Visual Basic
Public Function Link ( _
	file As String, _
	options As DWFImportOptions _
) As IList(Of ElementId)
Visual C++
public:
IList<ElementId^>^ Link(
	String^ file,
	DWFImportOptions^ options
)
Parameters
file
Type: System.String
 Full path of the file to link. File must exist and must be a valid DWF file.
options
Type: Autodesk.Revit.DB.DWFImportOptions
 Various link options applicable to the DWF format.
Return Value
 A collection of link instance element ids created by the markup link.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Not a valid file for DWF import (.dwf or.dwfx files are valid). -or- Some of the views is not importable.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.FileArgumentNotFoundException |  The given file does not exist.
Autodesk.Revit.Exceptions.InvalidOperationException |  Import is temporarily disabled.
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Document Class
Link Overload
Autodesk.Revit.DB Namespace